---
type: EdgeEndPoint
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# EdgeEndPoint

`Autodesk.Revit.DB.EdgeEndPoint` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | EdgeEndPoint | 2021 | `public EdgeEndPoint ( Edge edge , int index )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | — | `` |
| Method | Evaluate | 2021 | `public XYZ Evaluate ()` |
| Property | Edge | 2021 | `public Edge Edge { get ; }` |
| Property | Index | 2021 | `public int Index { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |